## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-07-26T20:09:45.000+0000" -> "2023-07-26T20:09:52.087+0000"
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ReceiveFFISEmail"
      ~ last_modified                  = "2023-07-26T20:09:39.742+0000" -> "2023-07-26T20:09:51.304+0000"
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.event.published"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.event.published"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.grant_data.invalid"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.grant_data.invalid"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.invocation_batch_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.invocation_batch_size"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.build"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.build"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.malformatted_field"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.malformatted_field"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.record.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.record.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_monitor.DownloadFFISSpreadsheet-failed[0] will be created
+   resource "datadog_monitor" "DownloadFFISSpreadsheet-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: Cannot download spreadsheet from FFIS.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): DownloadFFISSpreadsheet failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:downloadffisspreadsheet}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.DownloadGrantsGovDB-failed[0] will be created
+   resource "datadog_monitor" "DownloadGrantsGovDB-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: All attempts to download the latest grants database from grants.gov have failed in the past 10 hours.
            This may be due to a temporary service outage on grants.gov.
            Verify whether a download is available. If it is, investigate the cause of this failure,
            and then trigger a new download attempt.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): DownloadGrantsGovDB failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_10h):sum:aws.lambda.errors{env:staging,handlername:downloadgrantsgovdb}.as_count() / sum:aws.lambda.invocations{env:staging,handlername:downloadgrantsgovdb}.as_count() >= 1.0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.EnqueueFFISSpreadsheet-failed[0] will be created
+   resource "datadog_monitor" "EnqueueFFISSpreadsheet-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: Failed when attempting to enqueue download for FFIS spreadsheet link parsed from email.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): EnqueueFFISSpreadsheet failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:enqueueffisspreadsheet}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.ExtractGrantsGovXMLToDB-failed[0] will be created
+   resource "datadog_monitor" "ExtractGrantsGovXMLToDB-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Failed to extract XML from Grants.gov zip archive.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): ExtractGrantsGovXMLToDB failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:enqueueffisspreadsheet}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.PersistFFISData-failed[0] will be created
+   resource "datadog_monitor" "PersistFFISData-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: Failed to save FFIS data to DynamoDB.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): PersistFFISData failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:persistffisdata}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.PersistGrantsGovXMLDB-failed[0] will be created
+   resource "datadog_monitor" "PersistGrantsGovXMLDB-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: Failed to save Grants.gov data to DynamoDB.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): PersistGrantsGovXMLDB failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:persistgrantsgovxmldb}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.PublishGrantEvents-no_events_published[0] will be created
+   resource "datadog_monitor" "PublishGrantEvents-no_events_published" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: No grant modification events have been published in the past 4 days.
            While it is possible that new opportunities have not been created or modified,
            it likely indicates a problem with PublishGrantEvents or an earlier pipeline step.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): PublishGrantEvents has not published any events in a while"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_4d):sum:grants_ingest.PublishGrantEvents.event.published{env:staging}.as_count() < 1"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.ReceiveFFISEmail-failed[0] will be created
+   resource "datadog_monitor" "ReceiveFFISEmail-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: There was a problem with an email delivered to the FFIS inbox.
            This may be due to spam/virus detection or an unrecognized sender.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): ReceiveFFISEmail failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:receiveffisemail}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.SplitFFISSpreadsheet-failed[0] will be created
+   resource "datadog_monitor" "SplitFFISSpreadsheet-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: A failure occurred while attempting to parse data from an FFIS spreadsheet.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): SplitFFISSpreadsheet failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:splitffisspreadsheet}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.SplitFFISSpreadsheet-no_opportunities_created[0] will be created
+   resource "datadog_monitor" "SplitFFISSpreadsheet-no_opportunities_created" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: No new grant opportunities have been created from FFIS data in the past 9 days.
            While it is possible that new opportunities have not been published, it is unusual
            and likely indicates a problem with SplitFFISSpreadsheet or an earlier pipeline step.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): SplitFFISSpreadsheet has not created new grant opportunities"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_4d):sum:grants_ingest.SplitFFISSpreadsheet.opportunity.created{env:staging}.as_count() < 1"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.SplitGrantsGovXMLDB-failed[0] will be created
+   resource "datadog_monitor" "SplitGrantsGovXMLDB-failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: A failure occurred while attempting to parse data from a Grants.gov XML file.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): SplitGrantsGovXMLDB failed"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:splitgrantsgovxmldb}.as_count() > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.SplitGrantsGovXMLDB-no_opportunities_created[0] will be created
+   resource "datadog_monitor" "SplitGrantsGovXMLDB-no_opportunities_created" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            Alert: No new grant opportunities have been created from Grants.gov data in the past 4 days.
            While it is possible that new opportunities have not been published, it is unusual
            and likely indicates a problem with SplitGrantsGovXMLDB or an earlier pipeline step.
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): SplitGrantsGovXMLDB has not created new grant opportunities"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "sum(last_4d):sum:grants_ingest.SplitGrantsGovXMLDB.opportunity.created{env:staging}.as_count() < 1"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # datadog_monitor.events_failed_to_publish[0] will be created
+   resource "datadog_monitor" "events_failed_to_publish" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            {{#is_alert}}
            Alert: The PublishGrantEvents step was unable to publish one or more grant modifications received from DynamoDB.
            Investigate the issue and once resolved, re-trigger the step with the most-recent revision of the grant(s) associated with the failure.
            This monitor will not return to normal while there are messages in the DLQ.
            {{/is_alert}}
            {{#is_recovery}}
            Recovery: There are no longer messages in the DLQ.
            {{/is_recovery}}
            Notify:
        EOT
+       name                = "Grants Ingest (Draft - staging): Grant modification events failed to publish"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "min(last_1h):avg:aws.sqs.approximate_number_of_messages_visible{env:staging,queuename:publish_grant_events_dlq} > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:grants-ingest",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-07-26T20:09:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:16/invocations" -> (known after apply)
      ~ s3_key                         = "builds/dae36a7bf18708c92d9f492ce8933cdb225283aad4f3de727447125b51d09200.zip" -> "builds/6eaca927658a7650cd7f5eae49646eba71278db0626571c73530fa60e0eef46b.zip"
      ~ s3_object_version              = "8E3UquXsMiHCB2gOS1ZQi4NCa4jkcQNu" -> (known after apply)
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "16" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a13f6b2a93fceb645f37ff2cd42d0da3-2" -> (known after apply)
      ~ id                     = "builds/dae36a7bf18708c92d9f492ce8933cdb225283aad4f3de727447125b51d09200.zip" -> (known after apply)
      ~ key                    = "builds/dae36a7bf18708c92d9f492ce8933cdb225283aad4f3de727447125b51d09200.zip" -> "builds/6eaca927658a7650cd7f5eae49646eba71278db0626571c73530fa60e0eef46b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/dae36a7bf18708c92d9f492ce8933cdb225283aad4f3de727447125b51d09200.zip" -> "builds/6eaca927658a7650cd7f5eae49646eba71278db0626571c73530fa60e0eef46b.zip"
-       tags                   = {} -> null
      ~ version_id             = "8E3UquXsMiHCB2gOS1ZQi4NCa4jkcQNu" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/6eaca927658a7650cd7f5eae49646eba71278db0626571c73530fa60e0eef46b.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/6eaca927658a7650cd7f5eae49646eba71278db0626571c73530fa60e0eef46b.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8802666602549567808" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/dae36a7bf18708c92d9f492ce8933cdb225283aad4f3de727447125b51d09200.zip" -> "builds/6eaca927658a7650cd7f5eae49646eba71278db0626571c73530fa60e0eef46b.zip"
          ~ "timestamp" = "1690402148411869000" -> "1691704957508684000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7517173141170056763" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/dae36a7bf18708c92d9f492ce8933cdb225283aad4f3de727447125b51d09200.zip" -> "builds/6eaca927658a7650cd7f5eae49646eba71278db0626571c73530fa60e0eef46b.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-07-26T20:09:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:41" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:41/invocations" -> (known after apply)
      ~ s3_key                         = "builds/d1e54082a17f021046dfc9a2a6333f236fb0064d14748c595c113b5467135ae9.zip" -> "builds/ea2a3bfb7c2e7e5e7aa7e1439f3c987559cbd1f8dad3b9e740cd4122a3a5b20b.zip"
      ~ s3_object_version              = "x5_ns0xYA9_I175fWTlkruIcSO6eDla_" -> (known after apply)
        tags                           = {}
      ~ version                        = "41" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "41" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ea377de3d99906dde33cead217d82fc1-2" -> (known after apply)
      ~ id                     = "builds/d1e54082a17f021046dfc9a2a6333f236fb0064d14748c595c113b5467135ae9.zip" -> (known after apply)
      ~ key                    = "builds/d1e54082a17f021046dfc9a2a6333f236fb0064d14748c595c113b5467135ae9.zip" -> "builds/ea2a3bfb7c2e7e5e7aa7e1439f3c987559cbd1f8dad3b9e740cd4122a3a5b20b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/d1e54082a17f021046dfc9a2a6333f236fb0064d14748c595c113b5467135ae9.zip" -> "builds/ea2a3bfb7c2e7e5e7aa7e1439f3c987559cbd1f8dad3b9e740cd4122a3a5b20b.zip"
-       tags                   = {} -> null
      ~ version_id             = "x5_ns0xYA9_I175fWTlkruIcSO6eDla_" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/ea2a3bfb7c2e7e5e7aa7e1439f3c987559cbd1f8dad3b9e740cd4122a3a5b20b.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/ea2a3bfb7c2e7e5e7aa7e1439f3c987559cbd1f8dad3b9e740cd4122a3a5b20b.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7925699549531474118" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d1e54082a17f021046dfc9a2a6333f236fb0064d14748c595c113b5467135ae9.zip" -> "builds/ea2a3bfb7c2e7e5e7aa7e1439f3c987559cbd1f8dad3b9e740cd4122a3a5b20b.zip"
          ~ "timestamp" = "1690402130529126000" -> "1691704937291369000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4732960738805597378" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/d1e54082a17f021046dfc9a2a6333f236fb0064d14748c595c113b5467135ae9.zip" -> "builds/ea2a3bfb7c2e7e5e7aa7e1439f3c987559cbd1f8dad3b9e740cd4122a3a5b20b.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-07-26T20:09:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:21/invocations" -> (known after apply)
      ~ s3_key                         = "builds/edf5f4d61298ee9d15d39277440a7b987eb281fe075c15631913adaddfca1cbe.zip" -> "builds/d97d3ab66714b563a8088c8021a2d49ffa3e9c1f2adffd7b69822bd9442464a3.zip"
      ~ s3_object_version              = "XbCWG.qZmFr0szRGSHLEuj8DUksuglOI" -> (known after apply)
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "21" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d44672281d18543b46635e75bcf143ca-2" -> (known after apply)
      ~ id                     = "builds/edf5f4d61298ee9d15d39277440a7b987eb281fe075c15631913adaddfca1cbe.zip" -> (known after apply)
      ~ key                    = "builds/edf5f4d61298ee9d15d39277440a7b987eb281fe075c15631913adaddfca1cbe.zip" -> "builds/d97d3ab66714b563a8088c8021a2d49ffa3e9c1f2adffd7b69822bd9442464a3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/edf5f4d61298ee9d15d39277440a7b987eb281fe075c15631913adaddfca1cbe.zip" -> "builds/d97d3ab66714b563a8088c8021a2d49ffa3e9c1f2adffd7b69822bd9442464a3.zip"
-       tags                   = {} -> null
      ~ version_id             = "XbCWG.qZmFr0szRGSHLEuj8DUksuglOI" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/d97d3ab66714b563a8088c8021a2d49ffa3e9c1f2adffd7b69822bd9442464a3.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d97d3ab66714b563a8088c8021a2d49ffa3e9c1f2adffd7b69822bd9442464a3.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7470827629148130144" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/edf5f4d61298ee9d15d39277440a7b987eb281fe075c15631913adaddfca1cbe.zip" -> "builds/d97d3ab66714b563a8088c8021a2d49ffa3e9c1f2adffd7b69822bd9442464a3.zip"
          ~ "timestamp" = "1690402148516249800" -> "1691704956933826000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "9209698713593419588" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/edf5f4d61298ee9d15d39277440a7b987eb281fe075c15631913adaddfca1cbe.zip" -> "builds/d97d3ab66714b563a8088c8021a2d49ffa3e9c1f2adffd7b69822bd9442464a3.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-07-26T20:09:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:10/invocations" -> (known after apply)
      ~ s3_key                         = "builds/7519677d21620c43b4abba5366b6faf116b01c2a30be6660f5d9bf088aa03595.zip" -> "builds/b6f996e61d4823195334f1c287e0f37684035e08e518d7f0f6a97ed91ce109d3.zip"
      ~ s3_object_version              = "q1moQF74Uid3JM.nbl1Bm9yiUltObSpx" -> (known after apply)
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "10" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4da76459fd90179f8c369771ce899411-2" -> (known after apply)
      ~ id                     = "builds/7519677d21620c43b4abba5366b6faf116b01c2a30be6660f5d9bf088aa03595.zip" -> (known after apply)
      ~ key                    = "builds/7519677d21620c43b4abba5366b6faf116b01c2a30be6660f5d9bf088aa03595.zip" -> "builds/b6f996e61d4823195334f1c287e0f37684035e08e518d7f0f6a97ed91ce109d3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/7519677d21620c43b4abba5366b6faf116b01c2a30be6660f5d9bf088aa03595.zip" -> "builds/b6f996e61d4823195334f1c287e0f37684035e08e518d7f0f6a97ed91ce109d3.zip"
-       tags                   = {} -> null
      ~ version_id             = "q1moQF74Uid3JM.nbl1Bm9yiUltObSpx" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/b6f996e61d4823195334f1c287e0f37684035e08e518d7f0f6a97ed91ce109d3.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/b6f996e61d4823195334f1c287e0f37684035e08e518d7f0f6a97ed91ce109d3.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7038723674815984336" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7519677d21620c43b4abba5366b6faf116b01c2a30be6660f5d9bf088aa03595.zip" -> "builds/b6f996e61d4823195334f1c287e0f37684035e08e518d7f0f6a97ed91ce109d3.zip"
          ~ "timestamp" = "1690402148636374000" -> "1691704957472553000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "277121736914735698" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/7519677d21620c43b4abba5366b6faf116b01c2a30be6660f5d9bf088aa03595.zip" -> "builds/b6f996e61d4823195334f1c287e0f37684035e08e518d7f0f6a97ed91ce109d3.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-07-26T20:09:52.087+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:11/invocations" -> (known after apply)
      ~ s3_key                         = "builds/8b8ffb05752df45f4332fd3e2c162929634e0c177fc0d6ec8400a88cbca9cccf.zip" -> "builds/a3281b009959056e09500502fac6759c053fae72869406bf705d2af8e65c3a71.zip"
      ~ s3_object_version              = "IljJjdd.ENiYxBuzBWrnfj.eOIwQRyxU" -> (known after apply)
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "11" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e8a6097d865725b33ce3dd5376a4bdb6-2" -> (known after apply)
      ~ id                     = "builds/8b8ffb05752df45f4332fd3e2c162929634e0c177fc0d6ec8400a88cbca9cccf.zip" -> (known after apply)
      ~ key                    = "builds/8b8ffb05752df45f4332fd3e2c162929634e0c177fc0d6ec8400a88cbca9cccf.zip" -> "builds/a3281b009959056e09500502fac6759c053fae72869406bf705d2af8e65c3a71.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/8b8ffb05752df45f4332fd3e2c162929634e0c177fc0d6ec8400a88cbca9cccf.zip" -> "builds/a3281b009959056e09500502fac6759c053fae72869406bf705d2af8e65c3a71.zip"
-       tags                   = {} -> null
      ~ version_id             = "IljJjdd.ENiYxBuzBWrnfj.eOIwQRyxU" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/a3281b009959056e09500502fac6759c053fae72869406bf705d2af8e65c3a71.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a3281b009959056e09500502fac6759c053fae72869406bf705d2af8e65c3a71.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4916677601352210377" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8b8ffb05752df45f4332fd3e2c162929634e0c177fc0d6ec8400a88cbca9cccf.zip" -> "builds/a3281b009959056e09500502fac6759c053fae72869406bf705d2af8e65c3a71.zip"
          ~ "timestamp" = "1690402148619186000" -> "1691704956909631000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7437897009098549191" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/8b8ffb05752df45f4332fd3e2c162929634e0c177fc0d6ec8400a88cbca9cccf.zip" -> "builds/a3281b009959056e09500502fac6759c053fae72869406bf705d2af8e65c3a71.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-07-26T20:09:44.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:13" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:13/invocations" -> (known after apply)
      ~ s3_key                         = "builds/268b0ceef0455ac18d8f1af95bb37d27799cf754df54c5177cc57ab70dd58a65.zip" -> "builds/edfd868125e6dee2a2eaf3209bf77e76d444cd0eab409264c3f7986866799ced.zip"
      ~ s3_object_version              = "A92U2KY73WNyxZavBMFae.FCkiyZ75RH" -> (known after apply)
        tags                           = {}
      ~ version                        = "13" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "13" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a1f1445dd4946fd3bd1eda27559457e3-2" -> (known after apply)
      ~ id                     = "builds/268b0ceef0455ac18d8f1af95bb37d27799cf754df54c5177cc57ab70dd58a65.zip" -> (known after apply)
      ~ key                    = "builds/268b0ceef0455ac18d8f1af95bb37d27799cf754df54c5177cc57ab70dd58a65.zip" -> "builds/edfd868125e6dee2a2eaf3209bf77e76d444cd0eab409264c3f7986866799ced.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/268b0ceef0455ac18d8f1af95bb37d27799cf754df54c5177cc57ab70dd58a65.zip" -> "builds/edfd868125e6dee2a2eaf3209bf77e76d444cd0eab409264c3f7986866799ced.zip"
-       tags                   = {} -> null
      ~ version_id             = "A92U2KY73WNyxZavBMFae.FCkiyZ75RH" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/edfd868125e6dee2a2eaf3209bf77e76d444cd0eab409264c3f7986866799ced.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/edfd868125e6dee2a2eaf3209bf77e76d444cd0eab409264c3f7986866799ced.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4732855457993675404" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/268b0ceef0455ac18d8f1af95bb37d27799cf754df54c5177cc57ab70dd58a65.zip" -> "builds/edfd868125e6dee2a2eaf3209bf77e76d444cd0eab409264c3f7986866799ced.zip"
          ~ "timestamp" = "1690402130368400000" -> "1691704937800914000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2941928493120125292" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/268b0ceef0455ac18d8f1af95bb37d27799cf754df54c5177cc57ab70dd58a65.zip" -> "builds/edfd868125e6dee2a2eaf3209bf77e76d444cd0eab409264c3f7986866799ced.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PublishGrantEvents"
      ~ last_modified                  = "2023-07-26T20:09:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PublishGrantEvents:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PublishGrantEvents:3/invocations" -> (known after apply)
      ~ s3_key                         = "builds/e96bef8392e8dfe252b439028a03b4966d94fa980dc25abd3aa619422ce7055e.zip" -> "builds/79cbfa8d2acea40fbd5a260c954a8235a588524fca12d9f99b665dcee3bb50a7.zip"
      ~ s3_object_version              = "VuEZcriK1ra2m9K.eW.WE5G1kKq4hxwL" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1466ee50d43dedeae32806fb3bc18a14-2" -> (known after apply)
      ~ id                     = "builds/e96bef8392e8dfe252b439028a03b4966d94fa980dc25abd3aa619422ce7055e.zip" -> (known after apply)
      ~ key                    = "builds/e96bef8392e8dfe252b439028a03b4966d94fa980dc25abd3aa619422ce7055e.zip" -> "builds/79cbfa8d2acea40fbd5a260c954a8235a588524fca12d9f99b665dcee3bb50a7.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/e96bef8392e8dfe252b439028a03b4966d94fa980dc25abd3aa619422ce7055e.zip" -> "builds/79cbfa8d2acea40fbd5a260c954a8235a588524fca12d9f99b665dcee3bb50a7.zip"
-       tags                   = {} -> null
      ~ version_id             = "VuEZcriK1ra2m9K.eW.WE5G1kKq4hxwL" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PublishGrantEvents
                            cd bin/PublishGrantEvents
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/79cbfa8d2acea40fbd5a260c954a8235a588524fca12d9f99b665dcee3bb50a7.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/79cbfa8d2acea40fbd5a260c954a8235a588524fca12d9f99b665dcee3bb50a7.plan.json"
+       id                   = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1682352750843179951" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e96bef8392e8dfe252b439028a03b4966d94fa980dc25abd3aa619422ce7055e.zip" -> "builds/79cbfa8d2acea40fbd5a260c954a8235a588524fca12d9f99b665dcee3bb50a7.zip"
          ~ "timestamp" = "1690402131535796000" -> "1691704938881704000"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5181391643171609133" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/e96bef8392e8dfe252b439028a03b4966d94fa980dc25abd3aa619422ce7055e.zip" -> "builds/79cbfa8d2acea40fbd5a260c954a8235a588524fca12d9f99b665dcee3bb50a7.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ReceiveFFISEmail"
      ~ last_modified                  = "2023-07-26T20:09:51.304+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ReceiveFFISEmail:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ReceiveFFISEmail:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b09519e7a1959ad18e3431efb87e6b8cafb4d696ce2df1ffeeba5179d9742845.zip" -> "builds/54b998e12ca638b7fc3f8d20a323010e65b2bd4cad722a672538321c64f18abf.zip"
      ~ s3_object_version              = "XH2mfi.sqEM9pRfKmqJcX.tGTwP2K0Zr" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1175171dbc62e0ed7552721cc74c89ac-2" -> (known after apply)
      ~ id                     = "builds/b09519e7a1959ad18e3431efb87e6b8cafb4d696ce2df1ffeeba5179d9742845.zip" -> (known after apply)
      ~ key                    = "builds/b09519e7a1959ad18e3431efb87e6b8cafb4d696ce2df1ffeeba5179d9742845.zip" -> "builds/54b998e12ca638b7fc3f8d20a323010e65b2bd4cad722a672538321c64f18abf.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b09519e7a1959ad18e3431efb87e6b8cafb4d696ce2df1ffeeba5179d9742845.zip" -> "builds/54b998e12ca638b7fc3f8d20a323010e65b2bd4cad722a672538321c64f18abf.zip"
-       tags                   = {} -> null
      ~ version_id             = "XH2mfi.sqEM9pRfKmqJcX.tGTwP2K0Zr" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ReceiveFFISEmail
                            cd bin/ReceiveFFISEmail
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/54b998e12ca638b7fc3f8d20a323010e65b2bd4cad722a672538321c64f18abf.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/54b998e12ca638b7fc3f8d20a323010e65b2bd4cad722a672538321c64f18abf.plan.json"
+       id                   = (known after apply)
    }

  # module.ReceiveFFISEmail.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1042941034260978697" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b09519e7a1959ad18e3431efb87e6b8cafb4d696ce2df1ffeeba5179d9742845.zip" -> "builds/54b998e12ca638b7fc3f8d20a323010e65b2bd4cad722a672538321c64f18abf.zip"
          ~ "timestamp" = "1690402173797592000" -> "1691704957334608000"
        }
    }

  # module.ReceiveFFISEmail.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5399995781786588032" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b09519e7a1959ad18e3431efb87e6b8cafb4d696ce2df1ffeeba5179d9742845.zip" -> "builds/54b998e12ca638b7fc3f8d20a323010e65b2bd4cad722a672538321c64f18abf.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-07-26T20:09:46.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:12/invocations" -> (known after apply)
      ~ s3_key                         = "builds/289deb1f31d9500457c2c040af6e298cc0781d9c40728a068bfd2e9551b7f708.zip" -> "builds/8df4d764f4cf1db9e0ab1b4709830813e8b4dbc5e94a8a3dfce11af9e4c861fc.zip"
      ~ s3_object_version              = "5PFGeTVyY3PQR2mpp75USUa6qD0k4sxC" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6f38a2a9a5fa66f4e03bd97df0cf9659-2" -> (known after apply)
      ~ id                     = "builds/289deb1f31d9500457c2c040af6e298cc0781d9c40728a068bfd2e9551b7f708.zip" -> (known after apply)
      ~ key                    = "builds/289deb1f31d9500457c2c040af6e298cc0781d9c40728a068bfd2e9551b7f708.zip" -> "builds/8df4d764f4cf1db9e0ab1b4709830813e8b4dbc5e94a8a3dfce11af9e4c861fc.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/289deb1f31d9500457c2c040af6e298cc0781d9c40728a068bfd2e9551b7f708.zip" -> "builds/8df4d764f4cf1db9e0ab1b4709830813e8b4dbc5e94a8a3dfce11af9e4c861fc.zip"
-       tags                   = {} -> null
      ~ version_id             = "5PFGeTVyY3PQR2mpp75USUa6qD0k4sxC" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/8df4d764f4cf1db9e0ab1b4709830813e8b4dbc5e94a8a3dfce11af9e4c861fc.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/8df4d764f4cf1db9e0ab1b4709830813e8b4dbc5e94a8a3dfce11af9e4c861fc.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6959677179273709525" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/289deb1f31d9500457c2c040af6e298cc0781d9c40728a068bfd2e9551b7f708.zip" -> "builds/8df4d764f4cf1db9e0ab1b4709830813e8b4dbc5e94a8a3dfce11af9e4c861fc.zip"
          ~ "timestamp" = "1690402148533007000" -> "1691704957924743800"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8263796452557806641" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/289deb1f31d9500457c2c040af6e298cc0781d9c40728a068bfd2e9551b7f708.zip" -> "builds/8df4d764f4cf1db9e0ab1b4709830813e8b4dbc5e94a8a3dfce11af9e4c861fc.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-07-26T20:09:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:40/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c8b2ccad9ac3972808a1f78dc63fe12ac5186bd0e3a2c53b4f4eb02764c47058.zip" -> "builds/ecbb93785ea5cd070449b5d0edd54b4e4ae0bdeb93b8699f244ffd742ec6a284.zip"
      ~ s3_object_version              = "H4G9mNko6l3JcRLBxJgGvgrVmxZ3x_PZ" -> (known after apply)
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:c60513aca2078607ded416dc3da5f32723c68a73,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:8376cede3473b44bdaf6202e32778c21d0526f37,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "c60513aca2078607ded416dc3da5f32723c68a73" -> "8376cede3473b44bdaf6202e32778c21d0526f37"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "69c79ee3b0f33e09cb6251c8188c7146-2" -> (known after apply)
      ~ id                     = "builds/c8b2ccad9ac3972808a1f78dc63fe12ac5186bd0e3a2c53b4f4eb02764c47058.zip" -> (known after apply)
      ~ key                    = "builds/c8b2ccad9ac3972808a1f78dc63fe12ac5186bd0e3a2c53b4f4eb02764c47058.zip" -> "builds/ecbb93785ea5cd070449b5d0edd54b4e4ae0bdeb93b8699f244ffd742ec6a284.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c8b2ccad9ac3972808a1f78dc63fe12ac5186bd0e3a2c53b4f4eb02764c47058.zip" -> "builds/ecbb93785ea5cd070449b5d0edd54b4e4ae0bdeb93b8699f244ffd742ec6a284.zip"
-       tags                   = {} -> null
      ~ version_id             = "H4G9mNko6l3JcRLBxJgGvgrVmxZ3x_PZ" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/ecbb93785ea5cd070449b5d0edd54b4e4ae0bdeb93b8699f244ffd742ec6a284.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/ecbb93785ea5cd070449b5d0edd54b4e4ae0bdeb93b8699f244ffd742ec6a284.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4347797083630469713" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c8b2ccad9ac3972808a1f78dc63fe12ac5186bd0e3a2c53b4f4eb02764c47058.zip" -> "builds/ecbb93785ea5cd070449b5d0edd54b4e4ae0bdeb93b8699f244ffd742ec6a284.zip"
          ~ "timestamp" = "1690402129935345800" -> "1691704937827478800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "619851882394785801" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c8b2ccad9ac3972808a1f78dc63fe12ac5186bd0e3a2c53b4f4eb02764c47058.zip" -> "builds/ecbb93785ea5cd070449b5d0edd54b4e4ae0bdeb93b8699f244ffd742ec6a284.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 63 to add, 21 to change, 40 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5826501109)*